## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/82914214/runs/aa996dfc-1a6f-41a3-9df3-e6a1c6ee18d4).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_compute_instance.staging[0] will be created
+   resource "google_compute_instance" "staging" {
+       can_ip_forward       = false
+       cpu_platform         = (known after apply)
+       creation_timestamp   = (known after apply)
+       current_status       = (known after apply)
+       deletion_protection  = false
+       effective_labels     = {
+           "goog-terraform-provisioned" = "true"
        }
+       id                   = (known after apply)
+       instance_id          = (known after apply)
+       label_fingerprint    = (known after apply)
+       machine_type         = "e2-small"
+       metadata_fingerprint = (known after apply)
+       min_cpu_platform     = (known after apply)
+       name                 = "staging-instance"
+       project              = "terrateam-sandbox"
+       self_link            = (known after apply)
+       tags_fingerprint     = (known after apply)
+       terraform_labels     = {
+           "goog-terraform-provisioned" = "true"
        }
+       zone                 = "us-central1-a"
+
       boot_disk {
+           auto_delete                = true
+           device_name                = (known after apply)
+           disk_encryption_key_sha256 = (known after apply)
+           guest_os_features          = (known after apply)
+           kms_key_self_link          = (known after apply)
+           mode                       = "READ_WRITE"
+           source                     = (known after apply)
+
           initialize_params {
+               architecture           = (known after apply)
+               image                  = "debian-cloud/debian-11"
+               labels                 = (known after apply)
+               provisioned_iops       = (known after apply)
+               provisioned_throughput = (known after apply)
+               resource_policies      = (known after apply)
+               size                   = (known after apply)
+               snapshot               = (known after apply)
+               type                   = (known after apply)
            }
        }
+
       network_interface {
+           internal_ipv6_prefix_length = (known after apply)
+           ipv6_access_type            = (known after apply)
+           ipv6_address                = (known after apply)
+           name                        = (known after apply)
+           network                     = "default"
+           network_attachment          = (known after apply)
+           network_ip                  = (known after apply)
+           stack_type                  = (known after apply)
+           subnetwork                  = (known after apply)
+           subnetwork_project          = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
